app/Http/Controllers/DashboardController.php

select sum(`amount`) as aggregate from `spendings` where `spendings`.`space_id` = 1 and `spendings`.`space_id` is not null and YEAR(happened_on) = '2019' AND MONTH(happened_on) = '07' and `spendings`.`deleted_at` is null
select sum(`amount`) as aggregate from `earnings` where `earnings`.`space_id` = 1 and `earnings`.`space_id` is not null and YEAR(happened_on) = '2019' AND MONTH(happened_on) = '07' and `earnings`.`deleted_at` is null
select SUM(amount) total, description from `earnings` where `earnings`.`space_id` = 1 and `earnings`.`space_id` is not null and YEAR(happened_on) = '2019' AND MONTH(happened_on) = '07' and `earnings`.`deleted_at` is null group by `description` order by `total` asc
select SUM(amount) total, tag_id, name from `spendings` inner join `tags` on `spendings`.`tag_id` = `tags`.`id` where `spendings`.`space_id` = 1 and `spendings`.`space_id` is not null and YEAR(happened_on) = '2019' AND MONTH(happened_on) = '07' and `spendings`.`deleted_at` is null group by `tag_id` order by `total` asc
---
        $recurrings = session('space')->monthlyRecurrings($currentYear, $currentMonth);
        $leftToSpend = $balance - $recurrings;

        $totalSpent = session('space')->spendings()->whereRaw('YEAR(happened_on) = ? AND MONTH(happened_on) = ?', [$currentYear, $currentMonth])->sum('amount');
        $totalEarnt = session('space')->earnings()->whereRaw('YEAR(happened_on) = ? AND MONTH(happened_on) = ?', [$currentYear, $currentMonth])->sum('amount');

        $totalEarnt2 = session('space')->earnings()->whereRaw('YEAR(happened_on) = ? AND MONTH(happened_on) = ?', [$currentYear, $currentMonth])->groupBy('description')->selectRaw('SUM(amount) total, description')->orderBy('total')->get();
        $totalSpent2 = session('space')->spendings()->whereRaw('YEAR(happened_on) = ? AND MONTH(happened_on) = ?', [$currentYear, $currentMonth])->groupBy('tag_id')
            ->join('tags', 'spendings.tag_id', '=', 'tags.id')->selectRaw('SUM(amount) total, tag_id, name')->orderBy('total')->get();

select sum(`amount`) as aggregate from `spendings` where `spendings`.`space_id` = 1 and `spendings`.`space_id` is not null and `happened_on` = '2019-07-1' and `spendings`.`deleted_at` is null
---
        $balanceTick = 0;
        $dailyBalance = [];
        for ($i = 1; $i <= $daysInMonth; $i ++) {
            $balanceTick = session('space')
                ->spendings()
                ->where('happened_on', $currentYear . '-' . $currentMonth . '-' . $i)
                ->sum('amount');