app/Http/Controllers/TagController.php

select * from `tags` where `tags`.`space_id` = 1 and `tags`.`space_id` is not null and `tags`.`deleted_at` is null order by `created_at` desc
---
    public function index() {
        return view('tags.index', [
            'tags' => session('space')->tags()->orderBy('created_at', 'DESC')->get()
        ]);